
void main() {
  // 변수, 주석, 연산자, 데이터 타입, types, 연산자, 순서로 작성하자.
  /*

  * Flutter 교안5_목차

Dart 2 ~ 3 일
앱 개발 3일 - 6일

폴더 구조

FlutterStudy
	DartStudy
		ch01_basic
		ch02_controls

	FlutterStudy
		ch01
			first_app
		ch02
			basic_widgets
		ch03
			web_app


1. Dart 시작하기
	- 다트 환경설정
	- 다트 프로젝트 만들기
	- ch01_dart_basic 내용

2. Flutter 시작하기
	- Flutter 환경설정
	- Flutter 프로젝트 만들기
	- Virtual Device
	- 실제 단말기 테스트

3. Flutter 앱 기초 - 골든레빗
	- 간단한 앱 화면 구성 
	- 위젯 설명

4. 웹앱(p20) - 골든레빗

5. 전자액자(p20), 디지털 주사기(p30), 동영상 플레이어(p40), 오늘도 출첵(p30) - 골든레빗

6. 심리테스트(p40) - Doit

7. 부동산 조회 앱(p60) - Doit

8. SNS 앱 만들기(p90) - Doit

9. 일정관리(p130) - 골든레빗



// dart 언어의 목차는
// https://dart.dev/language  사이트의 순서와 같이 만들자.
  1. 다트 프로그래밍    
    1) 다트 시작하기
    2) 제어문
    3) 컬렉션
    4) 함수
    5) 클래스와 객체
    6) 상속
    7) 비동기 프로그래밍
    8) 3.0에 추가된 문법

   - Doit
    다트 라이브러리 추가
    파이어베이스
    
   4. 심리 테스트 앱
   5. 부동산 실거래가 조회 앱
   6. 클래식 사운드 앱
   7. SNS 앱

   - 골든레빗
  2. 플러터 시작하기 p123
    1) 플러터란
    2) 첫 번째 플러터 앱 만들기
    3) 앱 실행하기
    4) 기본 위젯
      위젯이란
      텍스트관련 위젯
      제스처 관련 위젯
      디자인 관련 위젯
      배치관련 위젯
    5) 앱을 만들려면 알아야할 지식 p189
      앱 만들기 프로세스
      플러그인 추가 방법
      주변 장치 종류
      연습용 앱 만들기
  3. 블로그 앱
  4. 전자액자
  5. 만난지 몇일
  6. 디지털 주사위
  7. 동영상 플레이어
  8. 영상 통화
  9. 오늘도 출첵
  10. 포토 스티커
  11. AI 채팅 봇, 소울챗
  12. 일정관리 앱
    - 레이아웃 구상
    - 데이터베이스 적용
    - 서버와 연동하기
    - 파이어베이스 연동하기
    - JWT를 이용한 인증하기
    - 소셜 로그인과 파이어베이스 연동
    - 슈파베이스 연동하기
    - 광고 및 배포하기
   



  */
}